Revit 2027 API
Application.GetLibraryPaths Method
 Returns path information identifying where Revit searches for content.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IDictionary<string, string> GetLibraryPaths()
Public Function GetLibraryPaths As IDictionary(Of String, String)
public:
IDictionary<String^, String^>^ GetLibraryPaths()
member GetLibraryPaths : unit -> IDictionary<string, string>
Return Value
IDictionary<String, String>
 The map of library paths.
Remarks
 The map that is returned contains a key that is purpose of the path, such as Material Libraries and the value in the map is the fully qualified path that is used for that search path.
Example
string strLibPaths = "";
foreach (String path in application.GetLibraryPaths().Values)
{
    strLibPaths += path + "\n";
}
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace